[
  {
    "AlertRuleTemplateName": null,
    "Description": "Create incidents based on all alerts generated in Azure Active Directory Identity Protection",
    "DisplayName": "Create incidents based on Azure Active Directory Identity Protection alerts",
    "DisplayNamesExcludeFilter": null,
    "DisplayNamesFilter": null,
    "Enabled": false,
    "Etag": "\"5c009e07-0000-0100-0000-6543ff310000\"",
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/d9ad5ce9-7550-4b19-a775-84d64e6cb617",
    "Kind": {},
    "LastModifiedUtc": "2023-11-02T19:57:37.7323465Z",
    "Name": "d9ad5ce9-7550-4b19-a775-84d64e6cb617",
    "ProductFilter": {},
    "SeveritiesFilter": null,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": "80da0a8f-cfe1-4cd0-a895-8bc1771a720e",
    "CustomDetail": {},
    "Description": "Checks for event id 1102 which indicates the security event log was cleared. \nIt uses Event Source Name \"Microsoft-Windows-Eventlog\" to avoid generating false positives from other sources, like AD FS servers for instance.",
    "DisplayName": "Security Event log cleared",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"00001d4e-0000-0100-0000-62f3cbad0000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": true,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/665f9380-8b5f-41aa-919d-cd5a377b47ca",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2022-08-10T15:15:57.1036072Z",
    "Name": "665f9380-8b5f-41aa-919d-cd5a377b47ca",
    "Query": "(union isfuzzy=true\n(\nSecurityEvent\n| where EventID == 1102 and EventSourceName == \"Microsoft-Windows-Eventlog\" \n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), EventCount = count() by Computer, Account, EventID, Activity\n| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer\n),\n(\nWindowsEvent\n| where EventID == 1102 and Provider == \"Microsoft-Windows-Eventlog\"  \n| extend Account =  strcat(tostring(EventData.SubjectDomainName),\"\\\\\", tostring(EventData.SubjectUserName))\n| extend Activity= \"1102 - The audit log was cleared.\"\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), EventCount = count() by Computer, Account, EventID, Activity\n| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer\n)\n)",
    "QueryFrequency": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "QueryPeriod": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "DefenseEvasion"
    ],
    "TemplateVersion": "1.1.1",
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "'This will alert when an admin or app owner account adds a new credential to an Application or Service Principal where there was no previous verify KeyCredential associated.\n  If a threat actor obtains access to an account with sufficient privileges and adds the alternate authentication material triggering this event, the threat actor can now authenticate as the Application or Service Principal using this credential.\n  Additional information on OAuth Credential Grants can be found in RFC 6749 Section 4.4 or https://docs.microsoft.com/azure/active-directory/develop/v2-oauth2-client-creds-grant-flow\nFor further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.'",
    "DisplayName": "First access credential added to Application or Service Principal where no credential was present(GH)",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"00001f4e-0000-0100-0000-62f3cdce0000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/6f55a336-e01b-411b-906a-9779d29b4429",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2022-08-10T15:25:01.8627715Z",
    "Name": "6f55a336-e01b-411b-906a-9779d29b4429",
    "Query": "  AuditLogs\r\n  | where OperationName has_any (\"Add service principal\", \"Certificates and secrets management\") // captures \"Add service principal\", \"Add service principal credentials\", and \"Update application - Certificates and secrets management\" events\r\n  | where Result =~ \"success\"\r\n  | where tostring(InitiatedBy.user.userPrincipalName) has \"@\" or tostring(InitiatedBy.app.displayName) has \"@\"\r\n  | extend targetDisplayName = tostring(TargetResources[0].displayName)\r\n  | extend targetId = tostring(TargetResources[0].id)\r\n  | extend targetType = tostring(TargetResources[0].type)\r\n  | extend keyEvents = TargetResources[0].modifiedProperties\r\n  | mv-expand keyEvents\r\n  | where keyEvents.displayName =~ \"KeyDescription\"\r\n  | extend new_value_set = parse_json(tostring(keyEvents.newValue))\r\n  | extend old_value_set = parse_json(tostring(keyEvents.oldValue))\r\n  | where old_value_set == \"[]\"\r\n  | mv-expand new_value_set\r\n  | parse new_value_set with * \"KeyIdentifier=\" keyIdentifier:string \",KeyType=\" keyType:string \",KeyUsage=\" keyUsage:string \",DisplayName=\" keyDisplayName:string \"]\" *\r\n  | where keyUsage == \"Verify\"  or keyUsage == \"\"\r\n  | extend UserAgent = iff(AdditionalDetails[0].key == \"User-Agent\",tostring(AdditionalDetails[0].value),\"\")\r\n  | extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName),tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))\r\n  | extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))\r\n  // The below line is currently commented out but Microsoft Sentinel users can modify this query to show only Application or only Service Principal events in their environment\r\n  //| where targetType =~ \"Application\" // or targetType =~ \"ServicePrincipal\"\r\n  | project-away new_value_set, old_value_set\r\n  | project-reorder TimeGenerated, OperationName, InitiatingUserOrApp, InitiatingIpAddress, UserAgent, targetDisplayName, targetId, targetType, keyDisplayName, keyType, keyUsage, keyIdentifier, CorrelationId, TenantId\r\n  | extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUserOrApp, IPCustomEntity = InitiatingIpAddress",
    "QueryFrequency": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "QueryPeriod": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "DefenseEvasion"
    ],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "",
    "DisplayName": "Longterm Leave Users SignIn Detected",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"00009f4f-0000-0100-0000-62f3f60b0000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/49b5045b-9dc9-4ebe-80e9-090fbd2dd70f",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2022-08-10T18:16:42.1838336Z",
    "Name": "49b5045b-9dc9-4ebe-80e9-090fbd2dd70f",
    "Query": "SigninLogs\r\n| extend UserPrincipalName_ = tolower(UserPrincipalName) | join (_GetWatchlist('extendedLeaveA')\r\n| where leave == 1 \r\n| project UserNames = tolower(UserName)\r\n) on $left.UserPrincipalName_ ==  $right.UserNames",
    "QueryFrequency": {
      "Ticks": 9000000000,
      "Days": 0,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 15,
      "Seconds": 0,
      "TotalDays": 0.010416666666666666,
      "TotalHours": 0.25,
      "TotalMilliseconds": 900000.0,
      "TotalMinutes": 15.0,
      "TotalSeconds": 900.0
    },
    "QueryPeriod": {
      "Ticks": 9000000000,
      "Days": 0,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 15,
      "Seconds": 0,
      "TotalDays": 0.010416666666666666,
      "TotalHours": 0.25,
      "TotalMilliseconds": 900000.0,
      "TotalMinutes": 15.0,
      "TotalSeconds": 900.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "InitialAccess"
    ],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": "Deny count alert from {{SourceIP}} to {{DestinationIP}} \n",
    "AlertDetailOverrideAlertDisplayNameFormat": "High number of denies alert from {{SourceIP}}",
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "Look for new Cisco events",
    "DisplayName": "Cisco Test",
    "Enabled": false,
    "EntityMapping": null,
    "Etag": "\"0101abe1-0000-0100-0000-64b6b7ec0000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/b780d202-dd5a-4190-86bc-0c0632a8ce16",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-07-18T16:03:56.3728587Z",
    "Name": "b780d202-dd5a-4190-86bc-0c0632a8ce16",
    "Query": "CommonSecurityLog\n| where DeviceVendor == \"Cisco\"\n| where DeviceAction == \"Deny\"\n| summarize DenyCount = count() by SourceIP, DestinationIP\n| where DenyCount > 5\n",
    "QueryFrequency": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "QueryPeriod": {
      "Ticks": 72000000000,
      "Days": 0,
      "Hours": 2,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.08333333333333333,
      "TotalHours": 2.0,
      "TotalMilliseconds": 7200000.0,
      "TotalMinutes": 120.0,
      "TotalSeconds": 7200.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "SuppressionEnabled": true,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "LateralMovement"
    ],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "Heartbeat silent health alert",
    "DisplayName": "TS-Agent heartbeat silent more than 30 min during last 24 hours",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"170154d8-0000-0100-0000-656faaa10000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": true,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [
      "Host",
      "IP"
    ],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 864000000000,
      "Days": 1,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 1.0,
      "TotalHours": 24.0,
      "TotalMilliseconds": 86400000.0,
      "TotalMinutes": 1440.0,
      "TotalSeconds": 86400.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/8a403a33-a9af-4957-991b-a5a89f3d5138",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-12-05T22:56:33.389393Z",
    "Name": "8a403a33-a9af-4957-991b-a5a89f3d5138",
    "Query": "Heartbeat\n//| where TimeGenerated >= ago(24h) //Set lookback period\n| summarize LastHeartbeat=arg_max(TimeGenerated, *) by Computer\n//Set offline criteria\n| extend Alive = case (LastHeartbeat >= now(-30m), 'Yes', 'No')\n//Calculate minutes since last heartbeat \n| extend MinutesSilent = datetime_diff('minute', now(), LastHeartbeat)\n| where Alive == 'No'\n| project Computer, ComputerIP, OSType, Alive, LastHeartbeat, MinutesSilent, ComputerEnvironment \n\n",
    "QueryFrequency": {
      "Ticks": 3000000000,
      "Days": 0,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 5,
      "Seconds": 0,
      "TotalDays": 0.003472222222222222,
      "TotalHours": 0.08333333333333333,
      "TotalMilliseconds": 300000.0,
      "TotalMinutes": 5.0,
      "TotalSeconds": 300.0
    },
    "QueryPeriod": {
      "Ticks": 864000000000,
      "Days": 1,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 1.0,
      "TotalHours": 24.0,
      "TotalMilliseconds": 86400000.0,
      "TotalMinutes": 1440.0,
      "TotalSeconds": 86400.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "Delete operations performed in your Microsoft Sentinel workspace",
    "DisplayName": "c_deleteOpsPerformed",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"9900d150-0000-0100-0000-64e771440000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/fed169de-1800-4a64-a6ce-9e0e526f6938",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-08-24T15:03:30.1041752Z",
    "Name": "fed169de-1800-4a64-a6ce-9e0e526f6938",
    "Query": "AuditLogs\r\n| where AADOperationType == \"Delete\"\r\n| where Result == \"success\"\r\n| project TimeGenerated, OperationName\r\n",
    "QueryFrequency": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "QueryPeriod": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": "194dd92e-d6e7-4249-85a5-273350a7f5ce",
    "CustomDetail": {},
    "Description": "Identifies when the exchange audit logging has been disabled which may be an adversary attempt\nto evade detection or avoid other defenses.",
    "DisplayName": "c_Exchange AuditLog disabled",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"9900bc54-0000-0100-0000-64e771510000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/ec9db1e7-c5c7-4b75-a6f3-3fccf3b46d8a",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-08-24T15:03:45.037944Z",
    "Name": "ec9db1e7-c5c7-4b75-a6f3-3fccf3b46d8a",
    "Query": "OfficeActivity\n| where UserType in~ (\"Admin\", \"DcAdmin\") \n| where Operation =~ \"Set-AdminAuditLogConfig\"\n| mv-expand param=parse_json(Parameters)\n| where param[\"Name\"] =~  \"UnifiedAuditLogIngestionEnabled\" and param[\"Value\"] =~ \"False\" // added unified audit log instead of Adminaudit log\n| summarize\n    StartTimeUtc = min(TimeGenerated),\n    EndTimeUtc = max(TimeGenerated),\n    OperationCount = count()\n    by\n    Operation,\n    UserType,\n    UserId,\n    ClientIP,\n    ResultStatus,\n    Parameters // tookout the admin audit parameter\n| extend\n    timestamp = StartTimeUtc,\n    AccountCustomEntity = UserId,\n    IPCustomEntity = ClientIP\n",
    "QueryFrequency": {
      "Ticks": 864000000000,
      "Days": 1,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 1.0,
      "TotalHours": 24.0,
      "TotalMilliseconds": 86400000.0,
      "TotalMinutes": 1440.0,
      "TotalSeconds": 86400.0
    },
    "QueryPeriod": {
      "Ticks": 8640000000000,
      "Days": 10,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 10.0,
      "TotalHours": 240.0,
      "TotalMilliseconds": 864000000.0,
      "TotalMinutes": 14400.0,
      "TotalSeconds": 864000.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "DefenseEvasion"
    ],
    "TemplateVersion": "1.0.0",
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "Sensitve Table Queried",
    "DisplayName": "c_HighRiskQueryRun",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"9900f559-0000-0100-0000-64e771610000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": true,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/8e16a2c1-94a0-419e-b25f-7645605945f6",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-08-24T15:04:01.1082463Z",
    "Name": "8e16a2c1-94a0-419e-b25f-7645605945f6",
    "Query": "let keywords = dynamic([\"AADUserRiskEvents\", \"IdentityInfo\"]);//specify list of items\nLAQueryLogs\n| extend keyword_lower = tolower(keywords) //convert all items in specified keywords list to lowercase\n| extend querytext_lower = tolower(QueryText) //convert kql queries executed to lowercase\n| where querytext_lower has_any(keywords) //compare values with list mentioned\n| extend searchuser = AADEmail\n| project TimeGenerated, searchuser, QueryText, RequestClientApp, RequestTarget, ResponseCode, ResponseRowCount, ResponseDurationMs, CorrelationId\n\n",
    "QueryFrequency": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "QueryPeriod": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": "050b9b3d-53d0-4364-a3da-1b678b8211ec",
    "CustomDetail": {},
    "Description": "Identifies when a new privileged role is assigned to a user.  Any account eligible for a role is now being given privileged access. If the assignment is unexpected or into a role that isn't the responsibility of the account holder, investigate.\nRef : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor-1",
    "DisplayName": "TS-User Assigned Privileged Role",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"170126cd-0000-0100-0000-656faa760000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/353de1d3-a05c-4621-b6b9-cd9758599a25",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-12-05T22:55:50.0591795Z",
    "Name": "353de1d3-a05c-4621-b6b9-cd9758599a25",
    "Query": "AuditLogs\n| where Category =~ \"RoleManagement\"\n| where AADOperationType in (\"Assign\", \"AssignEligibleRole\")\n| where ActivityDisplayName has_any (\"Add eligible member to role\", \"Add member to role\")\n| mv-expand TargetResources\n| mv-expand TargetResources.modifiedProperties\n| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)\n| where displayName_ =~ \"Role.DisplayName\"\n| extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))\n| where RoleName contains \"Admin\"\n| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)\n| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))\n| extend Target = tostring(TargetResources.userPrincipalName)\n| summarize by bin(TimeGenerated, 1h), OperationName,  RoleName, Target, Initiator, Result\n| extend AccountCustomEntity = Target",
    "QueryFrequency": {
      "Ticks": 6000000000,
      "Days": 0,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 10,
      "Seconds": 0,
      "TotalDays": 0.006944444444444444,
      "TotalHours": 0.16666666666666666,
      "TotalMilliseconds": 600000.0,
      "TotalMinutes": 10.0,
      "TotalSeconds": 600.0
    },
    "QueryPeriod": {
      "Ticks": 72000000000,
      "Days": 0,
      "Hours": 2,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.08333333333333333,
      "TotalHours": 2.0,
      "TotalMilliseconds": 7200000.0,
      "TotalMinutes": 120.0,
      "TotalSeconds": 7200.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "Persistence"
    ],
    "TemplateVersion": "1.0.1",
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "Delete operations performed in your Microsoft Sentinel workspace",
    "DisplayName": "TS-deleteOpsPerformed_c",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"8b0079dc-0000-0100-0000-64e73f270000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": false,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/feb179f0-8534-48e3-a1b7-a3ebabb2b785",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-08-24T11:29:42.7155464Z",
    "Name": "feb179f0-8534-48e3-a1b7-a3ebabb2b785",
    "Query": "AuditLogs\n| where AADOperationType =~ \"Delete\"\n| where Result == \"success\"\n| extend type_ = tostring(TargetResources[0].type)\n| extend targetuserPrincipalName_ = tostring(TargetResources[0].userPrincipalName)\n| extend targetdisplayName = tostring(TargetResources[0].displayName)\n| extend InitiatedByActionUserInformation = iff(isnotempty(InitiatedBy.user.userPrincipalName), InitiatedBy.user.userPrincipalName, InitiatedBy.app.displayName)\n| extend targetusrInformation = iff(targetuserPrincipalName_ != \"\", substring(tostring(TargetResources[0].userPrincipalName), toint(strlen(tostring(TargetResources[0].id))) - countof(tostring(TargetResources[0].id), '-')), targetdisplayName)\n| project targetusrInformation, type_, InitiatedByActionUserInformation\n\n",
    "QueryFrequency": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "QueryPeriod": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [
      "InitialAccess"
    ],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": null,
    "AlertDetailOverrideAlertDisplayNameFormat": null,
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "",
    "DisplayName": "test-Aashish-HealthAlertEmail",
    "Enabled": false,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"0900dfbf-0000-0100-0000-653c14ff0000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": true,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [
      "Host"
    ],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/7fb8499a-7792-4cbf-b078-162d746886d2",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-10-27T19:52:31.5997738Z",
    "Name": "7fb8499a-7792-4cbf-b078-162d746886d2",
    "Query": "AzureActivity\n| sort by TimeGenerated\n| summarize by CallerIpAddress\n",
    "QueryFrequency": {
      "Ticks": 432000000000,
      "Days": 0,
      "Hours": 12,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.5,
      "TotalHours": 12.0,
      "TotalMilliseconds": 43200000.0,
      "TotalMinutes": 720.0,
      "TotalSeconds": 43200.0
    },
    "QueryPeriod": {
      "Ticks": 432000000000,
      "Days": 0,
      "Hours": 12,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.5,
      "TotalHours": 12.0,
      "TotalMilliseconds": 43200000.0,
      "TotalMinutes": 720.0,
      "TotalSeconds": 43200.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  },
  {
    "AlertDetailOverrideAlertDescriptionFormat": "Alert at {{Time}} from {{City}}",
    "AlertDetailOverrideAlertDisplayNameFormat": "Alert for {{UserPrincipalName}} from {{ProviderName}|",
    "AlertDetailOverrideAlertSeverityColumnName": null,
    "AlertDetailOverrideAlertTacticsColumnName": null,
    "AlertRuleTemplateName": null,
    "CustomDetail": {},
    "Description": "login from outside of toronto",
    "DisplayName": "TS-Login from outside Toronto",
    "Enabled": true,
    "EntityMapping": [
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping",
      "Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.EntityMapping"
    ],
    "Etag": "\"1701e2c5-0000-0100-0000-656faa5c0000\"",
    "EventGroupingSettingAggregationKind": {},
    "GroupingConfigurationEnabled": true,
    "GroupingConfigurationGroupByAlertDetail": [],
    "GroupingConfigurationGroupByCustomDetail": [],
    "GroupingConfigurationGroupByEntity": [],
    "GroupingConfigurationLookbackDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "GroupingConfigurationMatchingMethod": {},
    "GroupingConfigurationReopenClosedIncident": false,
    "Id": "/subscriptions/26613501-ed23-4f10-8aed-bd633914579d/resourceGroups/wksp-ws-01/providers/Microsoft.OperationalInsights/workspaces/wksp-la/providers/Microsoft.SecurityInsights/alertRules/303bc74c-83d9-45a2-8a6b-7ec7392e440d",
    "IncidentConfigurationCreateIncident": true,
    "Kind": {},
    "LastModifiedUtc": "2023-12-05T22:55:23.3604988Z",
    "Name": "303bc74c-83d9-45a2-8a6b-7ec7392e440d",
    "Query": "SigninLogs\n| where UserPrincipalName == \"rpol@telussecuritydev.onmicrosoft.com\"\n| project\n    TimeGenerated,\n    UserPrincipalName,\n    Identity,\n    IPAddress,\n    LocationDetails.city,\n    LocationDetails.state,\n    LocationDetails.countryOrRegion\n| project-rename\n    Time=TimeGenerated,\n    City=LocationDetails_city,\n    Province=LocationDetails_state,\n    Country=LocationDetails_countryOrRegion\n| where City <> \"Toronto\"",
    "QueryFrequency": {
      "Ticks": 6000000000,
      "Days": 0,
      "Hours": 0,
      "Milliseconds": 0,
      "Minutes": 10,
      "Seconds": 0,
      "TotalDays": 0.006944444444444444,
      "TotalHours": 0.16666666666666666,
      "TotalMilliseconds": 600000.0,
      "TotalMinutes": 10.0,
      "TotalSeconds": 600.0
    },
    "QueryPeriod": {
      "Ticks": 36000000000,
      "Days": 0,
      "Hours": 1,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.041666666666666664,
      "TotalHours": 1.0,
      "TotalMilliseconds": 3600000.0,
      "TotalMinutes": 60.0,
      "TotalSeconds": 3600.0
    },
    "Severity": {},
    "SuppressionDuration": {
      "Ticks": 180000000000,
      "Days": 0,
      "Hours": 5,
      "Milliseconds": 0,
      "Minutes": 0,
      "Seconds": 0,
      "TotalDays": 0.20833333333333334,
      "TotalHours": 5.0,
      "TotalMilliseconds": 18000000.0,
      "TotalMinutes": 300.0,
      "TotalSeconds": 18000.0
    },
    "SuppressionEnabled": false,
    "SystemData": {
      "CreatedAt": null,
      "CreatedBy": null,
      "CreatedByType": null,
      "LastModifiedAt": null,
      "LastModifiedBy": null,
      "LastModifiedByType": null
    },
    "SystemDataCreatedAt": null,
    "SystemDataCreatedBy": null,
    "SystemDataCreatedByType": null,
    "SystemDataLastModifiedAt": null,
    "SystemDataLastModifiedBy": null,
    "SystemDataLastModifiedByType": null,
    "Tactic": [],
    "TemplateVersion": null,
    "TriggerOperator": {},
    "TriggerThreshold": 0,
    "Type": "Microsoft.SecurityInsights/alertRules"
  }
]
